-- MySQL dump 10.13  Distrib 5.7.41, for Linux (x86_64)
--
-- Host: localhost    Database: vpn_db
-- ------------------------------------------------------
-- Server version	5.7.41

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `com_captcha`
--

DROP TABLE IF EXISTS `com_captcha`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `com_captcha` (
  `captcha_id` varchar(255) NOT NULL,
  `text` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`captcha_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `com_captcha`
--

LOCK TABLES `com_captcha` WRITE;
/*!40000 ALTER TABLE `com_captcha` DISABLE KEYS */;
INSERT INTO `com_captcha` VALUES ('0433FB9F87378A7D8392E1CC80701A3A','2618'),('0DB81C484B8264022C66FEB4B1F344FB','6080'),('18D63DD53115C20D2E489C912C0E6131','6189'),('1AD546C56FABF7BD8DD7A646ECA91EE5','4345'),('224D6E99C9F3AF72B99042573341C7B7','6568'),('25E16C6726BCF28935A0B45CABAFFC28','4235'),('2FDBE5EDF64D5F9A760B21C4FBFC96E4','3112'),('387D98AA0D738E624A4D6910CEE819E3','7276'),('3A187284157C822C0B307E2A08D3826C','8632'),('3E00DAD69C68597B1924DD3927CFDC22','0290'),('3E7BC5C0642B651C49B08DC825570ED7','8591'),('428236F6ECCB06716B26CB17E6383D51','4753'),('43581D2CFA2580C607E06758EBCF8DFF','0596'),('4810C2019250925A783AD033EDCC974D','2994'),('50E84C78B429F32F846CD594F0CD6C8D','6406'),('57AAEE4C7FFA66B901AAAA0CB5AE0CCB','6176'),('61500C0D5F57A1E67D26702B9F12CAF7','9741'),('69EAABEBCCBA783C9BCB4A8EBEAE817A','4620'),('73C8367DA81C68A64D48F33B6B1CFFBC','0030'),('790142808D94EC3487EF65C3CE8DACA7','3813'),('808C6C07B9E29172557DD2CFB07EDD10','9045'),('8B799E81735B9F5C43B721654E2B4C23','1978'),('92F64CBAA76E72AF6BCD68788FF8DAEC','1914'),('9F7BE99EA30ED41285880EA633FAC66B','0807'),('A07345EDA4F3CD5F84229FB46026FB72','4498'),('A1F9980F2A3A9FD9BAE8182BF57A1503','2597'),('A3E4AF5A3F443F9167D94A6A9404E4E4','4861'),('A78B8BB8F310771F10B4982D05072150','9403'),('A9C3FEC0866A11D475808D209473EBB3','8997'),('AFAA8480E5643908DFB587823C540701','3998'),('B4E3B60A0E19941D6BDD07F458E434D1','0073'),('B59CBE6C8A924246E3154A989C9120A9','4439'),('B8A97F69B1BBDBB6885A27A5DA917098','7832'),('BDECCC968C5D554B95E669C401A6938D','1486'),('C0CDF6C3ED23DE079A94834A7A37A859','2573'),('C594D423E13AA8B6FD9AAA3C8577AA66','1950'),('C9897DBB73FBFF9BE489F9394CE49C67','0774'),('CA398C2CC1E515758490E72570103AE7','8898'),('CD6A1FAA2B319CFDCFF4B434ACF11EEF','3755'),('CD74D2220FACB8819F1D84E7AB78C438','6994'),('CFDA0DF274C2C8E42BDEEDEC2AF63F2F','8033'),('D05D737C9856B0732EFBF5632F0F118A','4066'),('D2F59488B2AED40D6FA6C0A18036EA79','0775'),('D4DF9D45A012AA81A6DE0322905D009C','1521'),('D5652932CE9EFD7C00469A9CE1366927','5853'),('D588A7EA6029E6FAD68DA9D16082513F','2179'),('D72ACDDFEAC055D20DAA4B9D1A0AD34C','5668'),('DBB8312F97F3FAE176CF0568D128593D','8232'),('DF61CA78716BE8A2C79DA5E36523D760','8654'),('ECAF73E378CD74C5C1E9394935045AF1','2929'),('EFA1DC77A08AA2C815EB0866334E2EA9','6120'),('F5A0354D2B212588CA629983D10ED64D','7488'),('F8D593F606A53C56AB35A3568E84E49F','6949'),('F967C01E170FF71F726A0E2E3283A2A6','0324'),('FCDC190404A101A13C074726C3A3EFBB','3346'),('FE3758FE91C8B040397CF9BD4B47F8AA','6747'),('FE6DCB58B1041B2364515CE90E705C7F','2389'),('FFEA5024A2872AD24EC4E3C7EFB11969','4263');
/*!40000 ALTER TABLE `com_captcha` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `com_port`
--

DROP TABLE IF EXISTS `com_port`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `com_port` (
  `port` int(8) DEFAULT NULL,
  `password` varchar(255) DEFAULT NULL,
  `portal_id` bigint(18) DEFAULT NULL,
  `vpn_id` bigint(18) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `com_port`
--

LOCK TABLES `com_port` WRITE;
/*!40000 ALTER TABLE `com_port` DISABLE KEYS */;
INSERT INTO `com_port` VALUES (13902,'BnX021',5,1),(10479,'jq69Ku',6,1),(14096,'tS1ihO',9,1),(13717,'nP0VgI',12,1),(11195,'vN784E',13,1),(10397,'p941W1',5,5),(10421,'BliNwn',6,5),(14775,'6QqLTs',13,5),(11914,'HwM90X',9,5),(11401,'24ZR88',12,5);
/*!40000 ALTER TABLE `com_port` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `com_vpn`
--

DROP TABLE IF EXISTS `com_vpn`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `com_vpn` (
  `id` bigint(18) NOT NULL AUTO_INCREMENT,
  `ip` varchar(255) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `server` varchar(255) DEFAULT NULL,
  `server_ipv6` varchar(255) DEFAULT NULL,
  `local_address` varchar(255) DEFAULT NULL,
  `local_port` int(8) DEFAULT NULL,
  `timeout` int(8) DEFAULT NULL,
  `method` varchar(255) DEFAULT NULL,
  `protocol` varchar(255) DEFAULT NULL,
  `protocol_param` varchar(255) DEFAULT NULL,
  `obfs` varchar(255) DEFAULT NULL,
  `obfs_param` varchar(255) DEFAULT NULL,
  `redirect` varchar(255) DEFAULT NULL,
  `dns_ipv6` int(1) DEFAULT NULL,
  `fast_open` int(1) DEFAULT NULL,
  `workers` int(8) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `com_vpn`
--

LOCK TABLES `com_vpn` WRITE;
/*!40000 ALTER TABLE `com_vpn` DISABLE KEYS */;
INSERT INTO `com_vpn` VALUES (1,'154.13.6.184','vpn-qa.ti-bao.com美国','0.0.0.0','[::]','127.0.0.1',1080,120,'aes-256-cfb','auth_chain_a','','tls1.2_ticket_auth','','',2,2,1),(5,'117.18.7.122','vpn-qa.ti-bao.com香港','0.0.0.0','[::]','127.0.0.1',1080,120,'aes-256-cfb','auth_chain_a','','tls1.2_ticket_auth','','',2,2,1);
/*!40000 ALTER TABLE `com_vpn` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `ims_notice`
--

DROP TABLE IF EXISTS `ims_notice`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `ims_notice` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `org_id` bigint(20) DEFAULT NULL COMMENT '公告维护者，管理员|分公司',
  `level` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '展示层级，1-总公司，2-分公司，3-一级代理，4-二级，5-三级，6-四级，7-五级，8-六级，9-七级，10-八级，11-九级，12-十级，13-会员',
  `type` int(11) NOT NULL DEFAULT '1' COMMENT '1-跑马灯，2-弹出框，3-首页显示',
  `status` int(11) NOT NULL DEFAULT '1' COMMENT '状态1-可用，2-禁用',
  `over_time` datetime DEFAULT NULL COMMENT '过期时间',
  `content` text COLLATE utf8_bin NOT NULL COMMENT '内容',
  `sort` int(11) DEFAULT '0' COMMENT '排序',
  `create_by` varchar(32) COLLATE utf8_bin NOT NULL,
  `create_time` datetime NOT NULL,
  `update_by` varchar(32) COLLATE utf8_bin NOT NULL,
  `update_time` datetime NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin ROW_FORMAT=DYNAMIC COMMENT='信息发布表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ims_notice`
--

LOCK TABLES `ims_notice` WRITE;
/*!40000 ALTER TABLE `ims_notice` DISABLE KEYS */;
/*!40000 ALTER TABLE `ims_notice` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `oper_log`
--

DROP TABLE IF EXISTS `oper_log`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `oper_log` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '自增键',
  `mod_type` int(11) DEFAULT NULL,
  `oper_id` bigint(20) DEFAULT NULL COMMENT '操作者ID',
  `oper_acc` varchar(32) CHARACTER SET utf8 DEFAULT NULL COMMENT '操作者账号',
  `oper_role` int(11) DEFAULT NULL COMMENT '代理层级',
  `oper_role_name` varchar(32) CHARACTER SET utf8 DEFAULT NULL COMMENT '机构名称',
  `assigned_id` bigint(20) DEFAULT NULL,
  `assigned_acc` varchar(32) CHARACTER SET utf8 DEFAULT NULL COMMENT '变更对象',
  `assigned_role` int(11) DEFAULT NULL,
  `assigned_role_name` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  `oper` varchar(255) CHARACTER SET utf8 DEFAULT NULL COMMENT '操作',
  `origin` varchar(255) CHARACTER SET utf8 DEFAULT NULL COMMENT '原始值',
  `changed` varchar(255) CHARACTER SET utf8 DEFAULT NULL COMMENT '变更值',
  `oper_time` datetime DEFAULT NULL COMMENT '变更时间',
  `ip` varchar(15) DEFAULT NULL COMMENT 'ip',
  `ip_addr` varchar(255) CHARACTER SET utf8 DEFAULT '' COMMENT 'ip所在地',
  `branch_org` bigint(20) DEFAULT NULL COMMENT '分公司id',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=171 DEFAULT CHARSET=latin1;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `oper_log`
--

LOCK TABLES `oper_log` WRITE;
/*!40000 ALTER TABLE `oper_log` DISABLE KEYS */;
INSERT INTO `oper_log` VALUES (1,4,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 新增节点','-','154.13.6.184','2023-02-09 17:08:20','127.0.0.1','本机地址',NULL),(2,2,1,'lucky',1,'总公司',2,'awin01',2,'总公司',' 总公司账号新增总公司 awin01账号','-','-','2023-02-09 17:08:50','127.0.0.1','本机地址',2),(3,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 退出成功','-','-','2023-02-09 17:15:09','127.0.0.1','本机地址',NULL),(4,1,2,'awin01',2,'公司',2,'awin01',2,'公司',' 公司   awin01 登入成功','-','-','2023-02-09 17:15:22','127.0.0.1','本机地址',2),(5,2,2,'awin01',2,'公司',2,'awin01',2,'公司',' 公司  awin01 更换登录密码','-','-','2023-02-09 17:15:33','127.0.0.1','本机地址',2),(6,1,2,'awin01',2,'公司',2,'awin01',2,'公司',' 公司   awin01 登入成功','-','-','2023-02-09 17:15:43','127.0.0.1','本机地址',2),(7,2,2,'awin01',2,'公司',3,'xing01',3,'公司',' 公司账号新增公司 xing01账号','-','-','2023-02-09 17:16:21','127.0.0.1','本机地址',2),(8,3,2,'awin01',2,'公司',3,'xing01',3,'一级代理',' 公司 更新：一级代理 xing01 流量','50','150','2023-02-09 17:16:33','127.0.0.1','本机地址',2),(9,2,2,'awin01',2,'公司',4,'xing2',4,'公司',' 公司账号新增公司 xing2账号','-','-','2023-02-09 17:16:56','127.0.0.1','本机地址',2),(10,2,2,'awin01',2,'公司',5,'xm01',5,'公司',' 公司账号新增公司 xm01账号','-','-','2023-02-09 17:17:36','127.0.0.1','本机地址',2),(11,1,2,'awin01',2,'公司',2,'awin01',2,'公司',' 公司   awin01 退出成功','-','-','2023-02-09 17:17:50','127.0.0.1','本机地址',2),(12,1,5,'xm01',5,'三级代理',5,'xm01',5,'三级代理',' 三级代理   xm01 登入成功','-','-','2023-02-09 17:18:01','127.0.0.1','本机地址',2),(13,2,5,'xm01',5,'三级代理',5,'xm01',5,'三级代理',' 三级代理  xm01 更换登录密码','-','-','2023-02-09 17:18:11','127.0.0.1','本机地址',2),(14,1,5,'xm01',5,'三级代理',5,'xm01',5,'三级代理',' 三级代理   xm01 登入成功','-','-','2023-02-09 17:18:24','127.0.0.1','本机地址',2),(15,1,5,'xm01',5,'三级代理',5,'xm01',5,'三级代理',' 三级代理   xm01 退出成功','-','-','2023-02-09 17:40:36','127.0.0.1','本机地址',2),(16,1,2,'awin01',2,'公司',2,'awin01',2,'公司','账号：awin01 登陆失败','-','-','2023-02-09 17:40:49','127.0.0.1','本机地址',2),(17,1,2,'awin01',2,'公司',2,'awin01',2,'公司',' 公司   awin01 登入成功','-','-','2023-02-09 17:40:58','127.0.0.1','本机地址',2),(18,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 登入成功','-','-','2023-02-10 17:15:44','127.0.0.1','本机地址',NULL),(19,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 登入成功','-','-','2023-02-10 17:40:08','127.0.0.1','本机地址',NULL),(20,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 登入成功','-','-','2023-02-14 16:08:14','127.0.0.1','本机地址',NULL),(21,4,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 修改节点','-','-','2023-02-14 16:26:15','127.0.0.1','本机地址',NULL),(22,2,1,'lucky',1,'总公司',2,'awin01',2,'公司',' 总公司账号更新公司 awin01的信息','-','-','2023-02-14 16:26:37','127.0.0.1','本机地址',2),(23,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 登入成功','-','-','2023-02-14 16:31:17','127.0.0.1','本机地址',NULL),(24,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 登入成功','-','-','2023-02-14 17:14:56','127.0.0.1','本机地址',NULL),(25,2,1,'lucky',1,'总公司',2,'awin01',2,'公司',' 总公司账号修改公司 awin01的节点','1','-','2023-02-14 17:15:16','127.0.0.1','本机地址',2),(26,2,1,'lucky',1,'总公司',2,'awin01',2,'公司',' 总公司账号修改公司 awin01的节点','1','-','2023-02-14 17:15:17','127.0.0.1','本机地址',2),(27,2,1,'lucky',1,'总公司',2,'awin01',2,'公司',' 总公司账号修改公司 awin01的节点','-','1','2023-02-14 17:18:11','127.0.0.1','本机地址',2),(28,2,1,'lucky',1,'总公司',2,'awin01',2,'公司',' 总公司账号修改公司 awin01的节点','-','1','2023-02-14 17:18:12','127.0.0.1','本机地址',2),(29,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 登入成功','-','-','2023-02-14 17:19:52','127.0.0.1','本机地址',NULL),(30,2,1,'lucky',1,'总公司',2,'awin01',2,'公司',' 总公司账号更新公司 awin01的信息','-','-','2023-02-14 17:20:06','127.0.0.1','本机地址',2),(31,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 登入成功','-','-','2023-02-14 17:30:51','127.0.0.1','本机地址',NULL),(32,2,1,'lucky',1,'总公司',2,'awin01',2,'公司',' 总公司账号修改公司 awin01的节点','1','-','2023-02-14 17:31:51','127.0.0.1','本机地址',2),(33,2,1,'lucky',1,'总公司',2,'awin01',2,'公司',' 总公司账号修改公司 awin01的节点','1','-','2023-02-14 17:31:52','127.0.0.1','本机地址',2),(34,2,1,'lucky',1,'总公司',2,'awin01',2,'公司',' 总公司账号修改公司 awin01的节点','-','1','2023-02-14 17:38:41','127.0.0.1','本机地址',2),(35,2,1,'lucky',1,'总公司',2,'awin01',2,'公司',' 总公司账号修改公司 awin01的节点','-','1','2023-02-14 17:38:42','127.0.0.1','本机地址',2),(36,2,1,'lucky',1,'总公司',2,'awin01',2,'公司',' 总公司账号修改公司 awin01的节点','1','-','2023-02-14 17:40:13','127.0.0.1','本机地址',2),(37,2,1,'lucky',1,'总公司',2,'awin01',2,'公司',' 总公司账号修改公司 awin01的节点','1','-','2023-02-14 17:40:14','127.0.0.1','本机地址',2),(38,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 登入成功','-','-','2023-02-15 10:15:28','127.0.0.1','本机地址',NULL),(39,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 登入成功','-','-','2023-02-15 15:36:53','54.199.41.49','日本东京Amazon数据中心',NULL),(40,4,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 修改节点','-','-','2023-02-15 15:38:00','54.199.41.49','日本东京Amazon数据中心',1),(41,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 登入成功','-','-','2023-02-15 16:05:49','54.199.41.49','日本东京Amazon数据中心',NULL),(42,2,1,'lucky',1,'总公司',2,'awin01',2,'公司',' 总公司账号修改公司 awin01的节点','-','1','2023-02-15 16:06:03','54.199.41.49','日本东京Amazon数据中心',2),(43,2,1,'lucky',1,'总公司',2,'awin01',2,'公司',' 总公司账号修改公司 awin01的节点','-','1','2023-02-15 16:06:03','54.199.41.49','日本东京Amazon数据中心',2),(44,3,1,'lucky',1,'总公司',2,'awin01',2,'公司',' 总公司 更新：公司 awin01 流量','350','536870912350','2023-02-15 16:06:41','54.199.41.49','日本东京Amazon数据中心',2),(45,3,1,'lucky',1,'总公司',2,'awin01',2,'公司',' 总公司 更新：公司 awin01 流量','536870912350','1073741824350','2023-02-15 16:06:41','54.199.41.49','日本东京Amazon数据中心',2),(46,3,1,'lucky',1,'总公司',3,'xing01',3,'一级代理',' 总公司 更新：一级代理 xing01 流量','50','107374182450','2023-02-15 16:07:00','54.199.41.49','日本东京Amazon数据中心',2),(47,3,1,'lucky',1,'总公司',4,'xing2',4,'二级代理',' 总公司 更新：二级代理 xing2 流量','90','85899346010','2023-02-15 16:07:14','54.199.41.49','日本东京Amazon数据中心',2),(48,2,1,'lucky',1,'总公司',2,'awin01',2,'公司',' 总公司账号修改公司 awin01的节点','1','-','2023-02-15 16:08:16','54.199.41.49','日本东京Amazon数据中心',2),(49,2,1,'lucky',1,'总公司',2,'awin01',2,'公司',' 总公司账号修改公司 awin01的节点','1','-','2023-02-15 16:08:16','54.199.41.49','日本东京Amazon数据中心',2),(50,2,1,'lucky',1,'总公司',2,'awin01',2,'公司',' 总公司账号修改公司 awin01的节点','-','1','2023-02-15 16:08:21','54.199.41.49','日本东京Amazon数据中心',2),(51,2,1,'lucky',1,'总公司',2,'awin01',2,'公司',' 总公司账号修改公司 awin01的节点','-','1','2023-02-15 16:08:21','54.199.41.49','日本东京Amazon数据中心',2),(52,3,1,'lucky',1,'总公司',5,'xm01',5,'三级代理',' 总公司 更新：三级代理 xm01 流量','10','21474836490','2023-02-15 16:08:40','54.199.41.49','日本东京Amazon数据中心',2),(53,1,5,'xm01',5,'三级代理',5,'xm01',5,'三级代理',' 三级代理   xm01 登入成功','-','-','2023-02-15 16:09:19','54.199.41.49','日本东京Amazon数据中心',2),(54,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 登入成功','-','-','2023-02-15 16:42:53','54.199.41.49','日本东京Amazon数据中心',NULL),(55,2,1,'lucky',1,'总公司',2,'awin01',2,'公司',' 总公司账号修改公司 awin01的节点','1','-','2023-02-15 16:43:07','54.199.41.49','日本东京Amazon数据中心',2),(56,2,1,'lucky',1,'总公司',2,'awin01',2,'公司',' 总公司账号修改公司 awin01的节点','1','-','2023-02-15 16:43:07','54.199.41.49','日本东京Amazon数据中心',2),(57,2,1,'lucky',1,'总公司',2,'awin01',2,'公司',' 总公司账号修改公司 awin01的节点','-','1','2023-02-15 16:43:18','54.199.41.49','日本东京Amazon数据中心',2),(58,2,1,'lucky',1,'总公司',2,'awin01',2,'公司',' 总公司账号修改公司 awin01的节点','-','1','2023-02-15 16:43:18','54.199.41.49','日本东京Amazon数据中心',2),(59,1,5,'xm01',5,'三级代理',5,'xm01',5,'三级代理',' 三级代理   xm01 登入成功','-','-','2023-02-15 16:44:24','54.199.41.49','日本东京Amazon数据中心',2),(60,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 退出成功','-','-','2023-02-15 16:46:15','54.199.41.49','日本东京Amazon数据中心',1),(61,1,2,'awin01',2,'公司',2,'awin01',2,'公司',' 公司   awin01 登入成功','-','-','2023-02-15 16:46:25','54.199.41.49','日本东京Amazon数据中心',2),(62,2,2,'awin01',2,'公司',6,'xm02',4,'公司',' 公司账号新增公司 xm02账号','-','-','2023-02-15 16:51:58','54.199.41.49','日本东京Amazon数据中心',2),(63,1,5,'xm01',5,'三级代理',5,'xm01',5,'三级代理',' 三级代理   xm01 退出成功','-','-','2023-02-15 16:52:14','54.199.41.49','日本东京Amazon数据中心',2),(64,1,6,'xm02',4,'二级代理',6,'xm02',4,'二级代理',' 二级代理   xm02 登入成功','-','-','2023-02-15 16:52:23','54.199.41.49','日本东京Amazon数据中心',2),(65,2,6,'xm02',4,'二级代理',6,'xm02',4,'二级代理',' 二级代理  xm02 更换登录密码','-','-','2023-02-15 16:52:35','54.199.41.49','日本东京Amazon数据中心',2),(66,1,6,'xm02',4,'二级代理',6,'xm02',4,'二级代理',' 二级代理   xm02 登入成功','-','-','2023-02-15 16:52:46','54.199.41.49','日本东京Amazon数据中心',2),(67,1,2,'awin01',2,'公司',2,'awin01',2,'公司',' 公司   awin01 退出成功','-','-','2023-02-15 17:55:30','54.199.41.49','日本东京Amazon数据中心',2),(68,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 登入成功','-','-','2023-02-15 21:48:11','203.160.86.9','香港中国联通(香港)运营有限公司',NULL),(69,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 退出成功','-','-','2023-02-15 21:50:49','203.160.86.9','香港中国联通(香港)运营有限公司',1),(70,1,2,'awin01',2,'公司',2,'awin01',2,'公司',' 公司   awin01 登入成功','-','-','2023-02-15 21:51:07','203.160.86.9','香港中国联通(香港)运营有限公司',2),(71,1,2,'awin01',2,'公司',2,'awin01',2,'公司',' 公司   awin01 退出成功','-','-','2023-02-15 21:52:19','203.160.86.9','香港中国联通(香港)运营有限公司',2),(72,1,6,'xm02',4,'二级代理',6,'xm02',4,'二级代理',' 二级代理   xm02 登入成功','-','-','2023-02-15 21:52:34','203.160.86.9','香港中国联通(香港)运营有限公司',2),(73,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 登入成功','-','-','2023-02-16 10:19:13','52.184.80.201','美国Microsoft公司',NULL),(74,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 登入成功','-','-','2023-02-16 11:19:59','54.199.41.49','日本东京Amazon数据中心',NULL),(75,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 登入成功','-','-','2023-02-16 14:36:28','54.199.41.49','日本东京Amazon数据中心',NULL),(76,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 退出成功','-','-','2023-02-16 14:38:04','54.199.41.49','日本东京Amazon数据中心',1),(77,1,2,'awin01',2,'公司',2,'awin01',2,'公司',' 公司   awin01 登入成功','-','-','2023-02-16 14:38:16','54.199.41.49','日本东京Amazon数据中心',2),(78,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 登入成功','-','-','2023-02-16 15:14:30','54.199.41.49','日本东京Amazon数据中心',NULL),(79,3,1,'lucky',1,'总公司',6,'xm02',4,'二级代理',' 总公司账号提取二级代理 xm02的所有流量','-','-','2023-02-16 15:14:49','54.199.41.49','日本东京Amazon数据中心',2),(80,3,1,'lucky',1,'总公司',6,'xm02',4,'二级代理',' 总公司 更新：二级代理 xm02 流量','15708075','1089449899','2023-02-16 15:17:55','54.199.41.49','日本东京Amazon数据中心',2),(81,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 退出成功','-','-','2023-02-16 15:22:22','54.199.41.49','日本东京Amazon数据中心',1),(82,1,2,'awin01',2,'公司',2,'awin01',2,'公司',' 公司   awin01 登入成功','-','-','2023-02-16 15:22:38','54.199.41.49','日本东京Amazon数据中心',2),(83,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 登入成功','-','-','2023-02-16 16:26:59','54.199.41.49','日本东京Amazon数据中心',NULL),(84,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 登入成功','-','-','2023-02-17 11:35:20','54.199.41.49','日本东京Amazon数据中心',NULL),(85,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 登入成功','-','-','2023-02-17 12:12:36','54.199.41.49','日本东京Amazon数据中心',NULL),(86,4,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 新增节点','-','216.83.42.76','2023-02-17 12:13:44','54.199.41.49','日本东京Amazon数据中心',1),(87,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 登入成功','-','-','2023-02-17 14:55:03','54.199.41.49','日本东京Amazon数据中心',NULL),(88,2,1,'lucky',1,'总公司',2,'awin01',2,'公司',' 总公司账号修改公司 awin01的节点','1','1,2','2023-02-17 14:55:19','54.199.41.49','日本东京Amazon数据中心',2),(89,2,1,'lucky',1,'总公司',2,'awin01',2,'公司',' 总公司账号修改公司 awin01的节点','1','1,2','2023-02-17 14:55:19','54.199.41.49','日本东京Amazon数据中心',2),(90,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 登入成功','-','-','2023-02-20 14:27:37','54.199.41.49','日本东京Amazon数据中心',NULL),(91,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 退出成功','-','-','2023-02-20 14:28:21','54.199.41.49','日本东京Amazon数据中心',1),(92,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 登入成功','-','-','2023-02-20 14:32:47','59.124.240.11','台湾省中华电信(HiNet)数据中心',NULL),(93,2,1,'lucky',1,'总公司',7,'greed001',2,'总公司',' 总公司账号新增总公司 greed001账号','-','-','2023-02-20 14:37:46','59.124.240.11','台湾省中华电信(HiNet)数据中心',7),(94,1,7,'greed001',2,'公司',7,'greed001',2,'公司',' 公司   greed001 登入成功','-','-','2023-02-20 14:38:07','59.124.240.11','台湾省中华电信(HiNet)数据中心',7),(95,2,7,'greed001',2,'公司',7,'greed001',2,'公司',' 公司  greed001 更换登录密码','-','-','2023-02-20 14:38:19','59.124.240.11','台湾省中华电信(HiNet)数据中心',7),(96,1,7,'greed001',2,'公司',7,'greed001',2,'公司',' 公司   greed001 登入成功','-','-','2023-02-20 14:38:28','59.124.240.11','台湾省中华电信(HiNet)数据中心',7),(97,2,7,'greed001',2,'公司',8,'greed111',3,'公司',' 公司账号新增公司 greed111账号','-','-','2023-02-20 15:00:42','59.124.240.11','台湾省中华电信(HiNet)数据中心',7),(98,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 退出成功','-','-','2023-02-20 15:01:27','59.124.240.11','台湾省中华电信(HiNet)数据中心',1),(99,1,8,'greed111',3,'一级代理',8,'greed111',3,'一级代理',' 一级代理   greed111 登入成功','-','-','2023-02-20 15:01:37','59.124.240.11','台湾省中华电信(HiNet)数据中心',7),(100,2,8,'greed111',3,'一级代理',8,'greed111',3,'一级代理',' 一级代理  greed111 更换登录密码','-','-','2023-02-20 15:01:47','59.124.240.11','台湾省中华电信(HiNet)数据中心',7),(101,1,8,'greed111',3,'一级代理',8,'greed111',3,'一级代理',' 一级代理   greed111 登入成功','-','-','2023-02-20 15:01:57','59.124.240.11','台湾省中华电信(HiNet)数据中心',7),(102,2,8,'greed111',3,'一级代理',9,'greed1111',4,'一级代理',' 一级代理账号新增一级代理 greed1111账号','-','-','2023-02-20 15:02:21','59.124.240.11','台湾省中华电信(HiNet)数据中心',7),(103,1,8,'greed111',3,'一级代理',8,'greed111',3,'一级代理',' 一级代理   greed111 退出成功','-','-','2023-02-20 15:02:27','59.124.240.11','台湾省中华电信(HiNet)数据中心',7),(104,1,9,'greed1111',4,'二级代理',9,'greed1111',4,'二级代理',' 二级代理   greed1111 登入成功','-','-','2023-02-20 15:02:35','59.124.240.11','台湾省中华电信(HiNet)数据中心',7),(105,2,9,'greed1111',4,'二级代理',9,'greed1111',4,'二级代理',' 二级代理  greed1111 更换登录密码','-','-','2023-02-20 15:02:43','59.124.240.11','台湾省中华电信(HiNet)数据中心',7),(106,1,9,'greed1111',4,'二级代理',9,'greed1111',4,'二级代理',' 二级代理   greed1111 登入成功','-','-','2023-02-20 15:02:51','59.124.240.11','台湾省中华电信(HiNet)数据中心',7),(107,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 登入成功','-','-','2023-02-20 15:03:57','59.124.240.11','台湾省中华电信(HiNet)数据中心',NULL),(108,4,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 删除节点','216.83.42.76','-','2023-02-20 15:07:12','59.124.240.11','台湾省中华电信(HiNet)数据中心',1),(109,4,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 新增节点','-','216.83.42.76','2023-02-20 15:07:37','59.124.240.11','台湾省中华电信(HiNet)数据中心',1),(110,4,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 删除节点','216.83.42.76','-','2023-02-20 15:07:48','59.124.240.11','台湾省中华电信(HiNet)数据中心',1),(111,4,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 新增节点','-','216.83.42.76','2023-02-20 15:08:38','59.124.240.11','台湾省中华电信(HiNet)数据中心',1),(112,2,1,'lucky',1,'总公司',7,'greed001',2,'公司',' 总公司账号修改公司 greed001的节点','-','1,4','2023-02-20 15:08:55','59.124.240.11','台湾省中华电信(HiNet)数据中心',7),(113,2,1,'lucky',1,'总公司',7,'greed001',2,'公司',' 总公司账号修改公司 greed001的节点','-','1,4','2023-02-20 15:08:56','59.124.240.11','台湾省中华电信(HiNet)数据中心',7),(114,1,9,'greed1111',4,'二级代理',9,'greed1111',4,'二级代理',' 二级代理   greed1111 退出成功','-','-','2023-02-20 15:09:22','59.124.240.11','台湾省中华电信(HiNet)数据中心',7),(115,2,1,'lucky',1,'总公司',7,'greed001',2,'公司',' 总公司账号更新公司 greed001的信息','-','-','2023-02-20 15:09:41','59.124.240.11','台湾省中华电信(HiNet)数据中心',7),(116,1,7,'greed001',2,'公司',7,'greed001',2,'公司',' 公司   greed001 登入成功','-','-','2023-02-20 15:09:48','59.124.240.11','台湾省中华电信(HiNet)数据中心',7),(117,2,7,'greed001',2,'公司',7,'greed001',2,'公司',' 公司  greed001 更换登录密码','-','-','2023-02-20 15:09:57','59.124.240.11','台湾省中华电信(HiNet)数据中心',7),(118,1,7,'greed001',2,'公司',7,'greed001',2,'公司',' 公司   greed001 登入成功','-','-','2023-02-20 15:10:09','59.124.240.11','台湾省中华电信(HiNet)数据中心',7),(119,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 登入成功','-','-','2023-02-20 17:25:23','117.18.7.249','香港特别行政区',NULL),(120,2,1,'lucky',1,'总公司',10,'aa68',2,'总公司',' 总公司账号新增总公司 aa68账号','-','-','2023-02-20 17:27:51','117.18.7.249','香港特别行政区',10),(121,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 退出成功','-','-','2023-02-20 17:31:48','117.18.7.249','香港特别行政区',1),(122,1,10,'aa68',2,'公司',10,'aa68',2,'公司',' 公司   aa68 登入成功','-','-','2023-02-20 17:31:57','117.18.7.249','香港特别行政区',10),(123,2,10,'aa68',2,'公司',10,'aa68',2,'公司',' 公司  aa68 更换登录密码','-','-','2023-02-20 17:32:11','117.18.7.249','香港特别行政区',10),(124,1,10,'aa68',2,'公司',10,'aa68',2,'公司',' 公司   aa68 登入成功','-','-','2023-02-20 17:32:22','117.18.7.249','香港特别行政区',10),(125,2,10,'aa68',2,'公司',11,'a001',3,'公司',' 公司账号新增公司 a001账号','-','-','2023-02-20 17:34:09','117.18.7.249','香港特别行政区',10),(126,2,10,'aa68',2,'公司',12,'b001',4,'公司',' 公司账号新增公司 b001账号','-','-','2023-02-20 17:34:50','117.18.7.249','香港特别行政区',10),(127,1,10,'aa68',2,'公司',10,'aa68',2,'公司',' 公司   aa68 退出成功','-','-','2023-02-20 17:49:09','117.18.7.249','香港特别行政区',10),(128,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 登入成功','-','-','2023-02-20 17:49:23','117.18.7.249','香港特别行政区',NULL),(129,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 退出成功','-','-','2023-02-20 17:50:18','117.18.7.249','香港特别行政区',1),(130,1,10,'aa68',2,'公司',10,'aa68',2,'公司',' 公司   aa68 登入成功','-','-','2023-02-20 17:50:29','117.18.7.249','香港特别行政区',10),(131,3,10,'aa68',2,'公司',11,'a001',3,'一级代理',' 公司 更新：一级代理 a001 流量','3.00G','8.00G','2023-02-20 17:52:11','117.18.7.249','香港特别行政区',10),(132,3,10,'aa68',2,'公司',11,'a001',3,'一级代理',' 公司 更新：一级代理 a001 流量','8.00G','5.00G','2023-02-20 17:52:21','117.18.7.249','香港特别行政区',10),(133,1,10,'aa68',2,'公司',10,'aa68',2,'公司',' 公司   aa68 登入成功','-','-','2023-02-20 17:56:02','154.13.6.184','美国',10),(134,1,10,'aa68',2,'公司',10,'aa68',2,'公司',' 公司   aa68 退出成功','-','-','2023-02-20 18:05:54','117.18.7.249','香港特别行政区',10),(135,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 登入成功','-','-','2023-02-21 10:17:10','54.199.41.49','日本东京Amazon数据中心',NULL),(136,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 退出成功','-','-','2023-02-21 10:27:00','54.199.41.49','日本东京Amazon数据中心',1),(137,1,10,'aa68',2,'公司',10,'aa68',2,'公司',' 公司   aa68 登入成功','-','-','2023-02-21 12:09:12','182.239.92.209','香港中国移动香港有限公司',10),(138,1,10,'aa68',2,'公司',10,'aa68',2,'公司',' 公司   aa68 登入成功','-','-','2023-02-21 23:52:50','182.239.92.209','香港中国移动香港有限公司',10),(139,1,9,'greed1111',4,'二级代理',9,'greed1111',4,'二级代理',' 二级代理   greed1111 登入成功','-','-','2023-02-23 10:54:24','54.199.41.49','日本东京Amazon数据中心',7),(140,1,2,'awin01',2,'公司',2,'awin01',2,'公司',' 公司   awin01 登入成功','-','-','2023-02-23 11:38:54','54.199.41.49','日本东京Amazon数据中心',2),(141,3,2,'awin01',2,'公司',3,'xing01',3,'一级代理',' 公司 更新：一级代理 xing01 流量','18.44G','318.44G','2023-02-23 11:39:32','54.199.41.49','日本东京Amazon数据中心',2),(142,2,2,'awin01',2,'公司',13,'win01',4,'公司',' 公司账号新增公司 win01账号','-','-','2023-02-23 11:40:27','54.199.41.49','日本东京Amazon数据中心',2),(143,1,2,'awin01',2,'公司',2,'awin01',2,'公司',' 公司   awin01 退出成功','-','-','2023-02-23 11:40:51','54.199.41.49','日本东京Amazon数据中心',2),(144,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 登入成功','-','-','2023-02-23 11:41:10','54.199.41.49','日本东京Amazon数据中心',NULL),(145,2,1,'lucky',1,'总公司',2,'awin01',2,'公司',' 总公司账号修改公司 awin01的节点','1','1,4','2023-02-23 11:41:35','54.199.41.49','日本东京Amazon数据中心',2),(146,2,1,'lucky',1,'总公司',2,'awin01',2,'公司',' 总公司账号修改公司 awin01的节点','1','1,4','2023-02-23 11:41:35','54.199.41.49','日本东京Amazon数据中心',2),(147,4,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 修改节点','-','-','2023-02-23 11:46:46','54.199.41.49','日本东京Amazon数据中心',1),(148,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司','账号：lucky 登陆失败','-','-','2023-02-23 16:45:48','117.18.7.11','香港特别行政区',NULL),(149,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 登入成功','-','-','2023-02-23 16:45:55','117.18.7.11','香港特别行政区',NULL),(150,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 退出成功','-','-','2023-02-23 17:08:42','117.18.7.11','香港特别行政区',1),(151,1,2,'awin01',2,'公司',2,'awin01',2,'公司',' 公司   awin01 登入成功','-','-','2023-02-23 17:18:57','117.18.7.11','香港特别行政区',2),(152,1,2,'awin01',2,'公司',2,'awin01',2,'公司',' 公司   awin01 退出成功','-','-','2023-02-23 17:19:18','117.18.7.11','香港特别行政区',2),(153,1,10,'aa68',2,'公司',10,'aa68',2,'公司',' 公司   aa68 登入成功','-','-','2023-02-24 15:34:42','182.239.92.209','香港中国移动香港有限公司',10),(154,1,10,'aa68',2,'公司',10,'aa68',2,'公司',' 公司   aa68 登入成功','-','-','2023-02-24 16:01:48','182.239.92.209','香港中国移动香港有限公司',10),(155,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 登入成功','-','-','2023-02-24 16:35:24','18.166.156.242','美国麻省理工学院',NULL),(156,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 退出成功','-','-','2023-02-24 16:45:07','18.166.156.242','美国麻省理工学院',1),(157,1,10,'aa68',2,'公司',10,'aa68',2,'公司',' 公司   aa68 登入成功','-','-','2023-02-24 16:51:13','182.239.92.209','香港中国移动香港有限公司',10),(158,3,10,'aa68',2,'公司',12,'b001',4,'二级代理',' 公司 更新：二级代理 b001 流量','1.97G','6.97G','2023-02-24 16:52:09','182.239.92.209','香港中国移动香港有限公司',10),(159,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 登入成功','-','-','2023-02-24 17:46:35','18.166.156.242','美国麻省理工学院',NULL),(160,4,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 删除节点','216.83.42.76','-','2023-02-24 17:47:04','18.166.156.242','美国麻省理工学院',1),(161,4,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 新增节点','-','117.18.7.122','2023-02-24 17:48:07','18.166.156.242','美国麻省理工学院',1),(162,2,1,'lucky',1,'总公司',2,'awin01',2,'公司',' 总公司账号修改公司 awin01的节点','1','1,5','2023-02-24 17:48:17','18.166.156.242','美国麻省理工学院',2),(163,2,1,'lucky',1,'总公司',2,'awin01',2,'公司',' 总公司账号修改公司 awin01的节点','1','1,5','2023-02-24 17:48:17','18.166.156.242','美国麻省理工学院',2),(164,2,1,'lucky',1,'总公司',7,'greed001',2,'公司',' 总公司账号修改公司 greed001的节点','1','1,5','2023-02-24 17:48:26','18.166.156.242','美国麻省理工学院',7),(165,2,1,'lucky',1,'总公司',7,'greed001',2,'公司',' 总公司账号修改公司 greed001的节点','1','1,5','2023-02-24 17:48:26','18.166.156.242','美国麻省理工学院',7),(166,2,1,'lucky',1,'总公司',10,'aa68',2,'公司',' 总公司账号修改公司 aa68的节点','1','1,5','2023-02-24 17:48:34','18.166.156.242','美国麻省理工学院',10),(167,2,1,'lucky',1,'总公司',10,'aa68',2,'公司',' 总公司账号修改公司 aa68的节点','1','1,5','2023-02-24 17:48:34','18.166.156.242','美国麻省理工学院',10),(168,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 退出成功','-','-','2023-02-24 17:53:57','18.166.156.242','美国麻省理工学院',1),(169,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 登入成功','-','-','2023-02-27 10:20:30','18.166.156.242','美国麻省理工学院',NULL),(170,1,1,'lucky',1,'总公司',1,'lucky',1,'总公司',' 总公司   lucky 退出成功','-','-','2023-02-27 10:30:38','18.166.156.242','美国麻省理工学院',1);
/*!40000 ALTER TABLE `oper_log` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `shedlock`
--

DROP TABLE IF EXISTS `shedlock`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `shedlock` (
  `name` varchar(64) NOT NULL,
  `lock_until` timestamp(3) NULL DEFAULT NULL,
  `locked_at` timestamp(3) NULL DEFAULT NULL,
  `locked_by` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`name`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `shedlock`
--

LOCK TABLES `shedlock` WRITE;
/*!40000 ALTER TABLE `shedlock` DISABLE KEYS */;
INSERT INTO `shedlock` VALUES ('BeginTimeqa','2023-06-28 14:59:00.047','2023-06-27 15:59:00.172','5d8cfaec73c5'),('TrafficChackqa','2023-06-28 12:02:06.795','2023-06-28 12:00:07.796','5d8cfaec73c5');
/*!40000 ALTER TABLE `shedlock` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `ums_account`
--

DROP TABLE IF EXISTS `ums_account`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `ums_account` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `pid` bigint(20) DEFAULT NULL,
  `account` varchar(100) DEFAULT NULL,
  `left_id` bigint(20) DEFAULT NULL,
  `right_id` bigint(20) DEFAULT NULL,
  `layer` int(11) DEFAULT NULL,
  `role` int(11) DEFAULT NULL,
  `company_id` bigint(18) DEFAULT NULL,
  `company_name` varchar(100) DEFAULT NULL,
  `nick_name` varchar(100) DEFAULT NULL,
  `password` varchar(500) DEFAULT NULL,
  `login_false_count` int(11) DEFAULT NULL,
  `is_init` int(11) DEFAULT NULL,
  `status` int(11) DEFAULT NULL,
  `mode` int(1) DEFAULT NULL,
  `create_by` varchar(100) DEFAULT NULL,
  `create_time` datetime DEFAULT NULL,
  `update_by` varchar(100) DEFAULT NULL,
  `update_time` datetime DEFAULT NULL,
  `last_login_time` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `account` (`account`) USING BTREE,
  KEY `select_acc` (`left_id`,`right_id`,`layer`,`role`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=14 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ums_account`
--

LOCK TABLES `ums_account` WRITE;
/*!40000 ALTER TABLE `ums_account` DISABLE KEYS */;
INSERT INTO `ums_account` VALUES (1,NULL,'lucky',1,26,1,1,NULL,NULL,'','191d7dd4b2ef68c38f561d7bd858884a',0,2,1,NULL,'system','2021-03-05 00:00:00','lucky','2021-07-19 19:49:57','2023-02-27 10:20:30'),(2,1,'awin01',2,13,2,2,2,NULL,'赢','191d7dd4b2ef68c38f561d7bd858884a',0,2,1,1,'lucky','2023-02-09 17:08:49','lucky','2023-02-24 17:48:15','2023-02-23 17:18:57'),(3,2,'xing01',3,12,3,3,2,NULL,'xin1','191d7dd4b2ef68c38f561d7bd858884a',0,1,1,1,'awin01','2023-02-09 17:16:20','awin01','2023-02-09 17:16:20','2023-02-09 17:16:20'),(4,3,'xing2',4,7,4,3,2,NULL,'xin2','191d7dd4b2ef68c38f561d7bd858884a',0,1,1,1,'awin01','2023-02-09 17:16:55','awin01','2023-02-09 17:16:55','2023-02-09 17:16:55'),(5,4,'xm01',5,6,5,5,2,NULL,'x1','191d7dd4b2ef68c38f561d7bd858884a',0,2,1,1,'awin01','2023-02-09 17:17:29','awin01','2023-02-09 17:17:29','2023-02-15 16:44:24'),(6,3,'xm02',8,9,4,5,2,NULL,'111','191d7dd4b2ef68c38f561d7bd858884a',0,2,1,1,'awin01','2023-02-15 16:51:55','awin01','2023-02-15 16:51:55','2023-02-15 21:52:34'),(7,1,'greed001',14,19,2,2,7,NULL,'123','4e86759c71106799a8361f609dc450e2',0,2,1,1,'lucky','2023-02-20 14:37:45','lucky','2023-02-24 17:48:25','2023-02-20 15:10:09'),(8,7,'greed111',15,18,3,3,7,NULL,'','4e86759c71106799a8361f609dc450e2',0,2,1,1,'greed001','2023-02-20 15:00:41','greed001','2023-02-20 15:00:41','2023-02-20 15:01:57'),(9,8,'greed1111',16,17,4,5,7,NULL,'','4e86759c71106799a8361f609dc450e2',0,2,1,1,'greed111','2023-02-20 15:02:21','greed111','2023-02-20 15:02:21','2023-02-23 10:54:24'),(10,1,'aa68',20,25,2,2,10,NULL,'aaa','98b8a7f4e0d3ccdb28456f5970ba34ca',0,2,1,1,'lucky','2023-02-20 17:27:51','lucky','2023-02-24 17:48:33','2023-02-24 16:51:13'),(11,10,'a001',21,24,3,3,10,NULL,'东东','5f1fbe3680d37189ce7f00ad1f0d22f3',0,1,1,1,'aa68','2023-02-20 17:34:08','aa68','2023-02-20 17:34:08','2023-02-20 17:34:08'),(12,11,'b001',22,23,4,5,10,NULL,'哈哈','5f1fbe3680d37189ce7f00ad1f0d22f3',0,1,1,1,'aa68','2023-02-20 17:34:39','aa68','2023-02-20 17:34:39','2023-02-20 17:34:39'),(13,3,'win01',10,11,4,5,2,NULL,'银','191d7dd4b2ef68c38f561d7bd858884a',0,1,1,1,'awin01','2023-02-23 11:40:24','awin01','2023-02-23 11:40:24','2023-02-23 11:40:24');
/*!40000 ALTER TABLE `ums_account` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `ums_traffic_all`
--

DROP TABLE IF EXISTS `ums_traffic_all`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `ums_traffic_all` (
  `account_id` bigint(18) NOT NULL,
  `traffic_all` decimal(32,0) DEFAULT NULL,
  `traffic_used` decimal(32,0) DEFAULT NULL,
  `end_time` datetime DEFAULT NULL,
  `type` int(1) DEFAULT NULL COMMENT '是否已经修改密码停用',
  PRIMARY KEY (`account_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ums_traffic_all`
--

LOCK TABLES `ums_traffic_all` WRITE;
/*!40000 ALTER TABLE `ums_traffic_all` DISABLE KEYS */;
INSERT INTO `ums_traffic_all` VALUES (2,644245094750,0,NULL,1),(3,234551605497,0,NULL,1),(4,64424509530,0,NULL,1),(5,21464416983,0,NULL,1),(6,1073586648,0,NULL,1),(7,5368709120,0,NULL,1),(8,3221225472,0,NULL,1),(9,2127014897,0,NULL,1),(10,99857989632,0,NULL,1),(11,0,0,NULL,1),(12,7315448191,0,NULL,1),(13,107325940214,0,NULL,1);
/*!40000 ALTER TABLE `ums_traffic_all` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `ums_traffic_his`
--

DROP TABLE IF EXISTS `ums_traffic_his`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `ums_traffic_his` (
  `portal_id` bigint(18) DEFAULT NULL,
  `traffic_used` decimal(32,0) DEFAULT NULL,
  `day_time` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ums_traffic_his`
--

LOCK TABLES `ums_traffic_his` WRITE;
/*!40000 ALTER TABLE `ums_traffic_his` DISABLE KEYS */;
INSERT INTO `ums_traffic_his` VALUES (5,10000,'2023-02-13 00:00:00'),(5,10418291,'2023-02-15 00:00:00'),(6,582145934,'2023-02-15 00:00:00'),(6,15708075,'2023-02-16 00:00:00'),(5,156,'2023-02-19 00:00:00'),(6,155176,'2023-02-19 00:00:00'),(5,44,'2023-02-20 00:00:00'),(9,2249996,'2023-02-20 00:00:00'),(12,12572571,'2023-02-20 00:00:00'),(12,832893,'2023-02-21 00:00:00'),(9,18218579,'2023-02-23 00:00:00'),(12,15100827,'2023-02-23 00:00:00'),(13,425641,'2023-02-23 00:00:00'),(12,35136,'2023-02-24 00:00:00'),(13,3005146,'2023-02-24 00:00:00'),(9,44,'2023-02-25 00:00:00'),(13,4944186,'2023-02-25 00:00:00'),(5,524,'2023-02-26 00:00:00'),(9,132,'2023-02-26 00:00:00'),(12,75456,'2023-02-27 00:00:00'),(13,39867213,'2023-02-27 00:00:00'),(12,121743915,'2023-02-28 00:00:00'),(12,50383779,'2023-03-01 00:00:00'),(5,492,'2023-03-02 00:00:00');
/*!40000 ALTER TABLE `ums_traffic_his` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `ums_vpn`
--

DROP TABLE IF EXISTS `ums_vpn`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `ums_vpn` (
  `vpn_id` bigint(18) DEFAULT NULL,
  `company_id` bigint(18) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ums_vpn`
--

LOCK TABLES `ums_vpn` WRITE;
/*!40000 ALTER TABLE `ums_vpn` DISABLE KEYS */;
INSERT INTO `ums_vpn` VALUES (1,2),(5,2),(1,7),(5,7),(1,10),(5,10);
/*!40000 ALTER TABLE `ums_vpn` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-08-21  9:40:25
